#include<iostream>

using namespace std;

int main(){
    // + - 还可以做正负数的表示

   //加减乘除
//    int a,b;
//    cin>>a>>b; // 10 3
//    cout<<a+b<<endl; // 13
//    cout<<a-b<<endl; // 7
//    cout<<a*b<<endl; // 30
//    cout<<a/b<<endl; // 3 整数相除结果任然是一个整数 去除小数部分
   // 尽量避免除数为0的情况 非法操作

   // 小数运算
//    double d = 5.2;
//    double e = 2.0;
//    cout<<d/e<<endl;

   // 取余运算
   // 本质上就是求余数的阶段
   int a =10;
   int b =3;
   // 除数也不可以为0
   cout<<a%b<<endl;
   
   /*两个小数是不可以做取余运算的*/
   /*只有整数才可以做取余运算*/

   // ----------------------------------------------------------------
   /*
   递增和递减
   1 前置递增/减
      先让变量加/减一，然后进行表达式运算
   2 后置递增/减
      先进行表达式运算，然后让变量加/减一
   */

   return 0;
}